In [2]:
import pandas as pd

In [2]:
# eg. syntax in pandas
# pd.DataFrame()
# pd.pivot_table()

## create dataframe form scratch

raw_data = {
    "name" : ["Toy", "Joe", "Marry", "John", "Anna"],
    "age" : [33, 25, 20, 22, 31],
    "gender" : ["M", "M", "F", "M", "F"]
}

df = pd.DataFrame(raw_data)

df

,name,age,gender
0,Toy,33,M
1,Joe,25,M
2,Marry,20,F
3,John,22,M
4,Anna,31,F

In [10]:
# add column
df['city'] = 'London'

In [11]:
df

,name,age,gender,city
0,Toy,33,M,London
1,Joe,25,M,London
2,Marry,20,F,London
3,John,22,M,London
4,Anna,31,F,London

In [12]:
# update column
df['city'] = ['London', 'London', 'London', 'Manchester', 'Liverpool']

In [13]:
df

,name,age,gender,city
0,Toy,33,M,London
1,Joe,25,M,London
2,Marry,20,F,London
3,John,22,M,Manchester
4,Anna,31,F,Liverpool

In [14]:
df.shape # attribute of dataframe row, column

(5, 4)

In [15]:
# drop column city
df = df.drop(labels='city', axis=1)
df

,name,age,gender
0,Toy,33,M
1,Joe,25,M
2,Marry,20,F
3,John,22,M
4,Anna,31,F

In [16]:
# remove row index = 2
df = df.drop(labels=2, axis=0)
df

,name,age,gender
0,Toy,33,M
1,Joe,25,M
3,John,22,M
4,Anna,31,F

In [17]:
# reset index
df = df.reset_index(drop=True)
df

,name,age,gender
0,Toy,33,M
1,Joe,25,M
2,John,22,M
3,Anna,31,F

In [18]:
# view attribute column name
list(df.columns)

['name', 'age', 'gender']

In [19]:
# rename columns
df.columns = ['nickname', 'age', 'sex']
df

,nickname,age,sex
0,Toy,33,M
1,Joe,25,M
2,John,22,M
3,Anna,31,F

In [21]:
## series vs dataframe
# view data in nickname column
df['nickname']

In [22]:
# view type
type(df['nickname'])

pandas.core.series.Series

In [23]:
# view type
type(df)

pandas.core.frame.DataFrame

In [25]:
## create a new series
s1 = pd.Series(['Marry', 20, 'F'], index=['nickname', 'age', 'sex'])
print(s1)
print(type(s1))

df

nickname    Marry
age            20
sex             F
dtype: object
<class 'pandas.core.series.Series'>

,nickname,age,sex
0,Toy,33,M
1,Joe,25,M
2,John,22,M
3,Anna,31,F

In [26]:
## append series
df = pd.concat([df, pd.DataFrame([s1])], ignore_index=True)

In [27]:
df

,nickname,age,sex
0,Toy,33,M
1,Joe,25,M
2,John,22,M
3,Anna,31,F
4,Marry,20,F

In [28]:
s2 = pd.Series(['London', 'London', 'London', 'Manchester', 'Liverpool'])
df['city'] = s2
df

,nickname,age,sex,city
0,Toy,33,M,London
1,Joe,25,M,London
2,John,22,M,London
3,Anna,31,F,Manchester
4,Marry,20,F,Liverpool

In [29]:
# write datafeame to csv
df.to_csv("my_data.csv")

In [30]:
# reade csv to dataframe
df2 = pd.read_csv("data/data.csv")
df2

,id,name,city
0,1,John,London
1,2,Joe,Liverpool
2,3,Mary,Manchester
3,4,Anna,Swansea
4,5,David,London

In [3]:
# read excel to dataframe
df3 = pd.read_excel("data/data.xlsx")

In [4]:
df3

,id,name,city
0,1,John,London
1,2,Joe,Liverpool
2,3,Mary,Manchester
3,4,Anna,Swansea
4,5,David,London

In [5]:

# read json to dataframe
df4 = pd.read_json('data/data.json')
df4

,ebook,language,amazonRating
0,Getting started with Python,python,4.89
1,Introduction to R,r,4.88
2,SQL for Beginners,sql,4.75

In [7]:
# read json to dataframe :: update file data.json add myFavorite
df5 = pd.read_json('data/data.json')
df5

,ebook,language,amazonRating,myFavorite
0,Getting started with Python,python,4.89,True
1,Introduction to R,r,4.88,True
2,SQL for Beginners,sql,4.75,False